Revit 2027 API
FabricationPart.SetPartCustomDataReal Method
 Set the custom data real value for the specified custom data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPartCustomDataReal(
	int customId,
	double value
)
Public Sub SetPartCustomDataReal (
	customId As Integer,
	value As Double
)
public:
void SetPartCustomDataReal(
	int customId,
	double value
)
member SetPartCustomDataReal :
        customId : int *
        value : float -> unit
Parameters
customId Int32
 The identifier of the custom data field to set.
value Double
 The real value of the custom data. If the data is not a real type the value will be parsed according to the fabrication confifuration rules.
Exceptions
Exception | Condition
ArgumentException |  The custom data does not exist on the part.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace